package romonuck.vlad.secondHomeWork;
/*
Завдання 1
Використовуючи свої знання, здобуті на лекції, написати самостійно програму в якому буде масив цілочисельних чисел,
який заповніть різними числами (десяти чисел буде досить). Використовуючи цикл та умовну конструкцію
для перевірки числа на парність виведіть на екран фразу «Число » + саме число + «парне/непарне»,
використавши метод System.out.println().
 */

public class Main1 {
    public static void main(String[] args) {
        int[] arr = new int[]{0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
        for (int i : arr) {
            if (i % 2 == 0) {
                System.out.println("Число " + i + " парне");
            } else {
                System.out.println("Число " + i + " непарне");
            }
        }
    }
}
