package romonuck.vlad.secondHomeWork;
/*
Завдання 3
Це завдання підвищеної складності. Завантажити програму PacmanAuto та проаналізувати її код.
Ця програма дещо відрізняється від попередньої. Тут не треба самому курувати Pacman-ом,
він вміє рухатись самостійно. Майже вміє. В програмі реалізований весь функціонал для руху по лабіринту,
але не вистачає алгоритму. Саме алгоритм Вам доведеться реалізувати.
Pacman рухається покроково, тому Вам необхідно буде застосувати цикл.
Наперед невідомо, яка кількість кроків буде необхідна, тому визначайтеся з яким циклом тут треба працювати.
Умовою завершення програми вважається момент, коли Pacman з’їсть усі крапочки.
Існує багато алгоритмів проходження по лабіринту, наприклад «триматися рукою за ліву/праву стінку».
Вам необхідно використати методи turnLeft() та turnRight(), які повертають Pacman-а обличчям у відповідному напрямку,
метод step() робить крок на одну «клітинку» вперед, а метод isWall() перевіряє,
чи є зараз перед обличчям у Pacman-а стіна, та повертає true або false. Код необхідно вставити в методі main(),
у визначеному місці. Запускайте програму у консолі. Мій алгоритм зайняв усього 6 рядочків коду. Успіхів.
 */
public class Main3 {
    public static void main(String[] args) {

    }
}
